app/controllers/school_classes_controller.rb

  def create
    @class = SchoolClass.create(params.require(:school_class).permit(:room_number, :title))
---
INSERT INTO "school_classes" ("room_number", "title") VALUES (?, ?)  [["room_number", 5], ["title", "Computer Science"]]