app/controllers/students_controller.rb

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-04-29 00:34:02.652890"], ["id", 1]]
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(params.require():student).permit(:first_name, :last_name))